var myChart2 = echarts.init(document.getElementById('data2'));
function getData2() {
  var data2 = JSON.parse(localStorage.getItem('data2'));
  return data2;
}
var data2Data = {
  '全国':{
    series1:[12.8, 10.8, 8.4, -52.1, 12.8, -22.1, 93.3],
    series2:[50.01, 55.39, 60.06, 28.79, 32.46, 25.3, 48.9, 55.3]
},
'北京':{
  series1:[4.4, 4.5, 3.7, -42.3, 38.8, -28.5, 79.8],
  series2:[2.93, 3.07, 3.18, 1.84, 2.55, 1.82, 3.29]
},
'四川':{
  series1:[6.2, 4.9, 7.0, -39.9, 7.6, -51.4, 189.4],
  series2:[6.7, 7.0, 7.5, 4.5, 4.84, 2.35, 6.8]
},
'海南':{
  series1:[12.0, 11.8, 8.9, -21.2, 25.6, -25.9, 49.4],
  series2:[0.67, 0.76, 0.82, 0.64, 0.81, 0.60, 0.90]
},
'河北':{
  series1:[22.7, 18.5, 15.5, -51.4, 19.7, -22.6, 154.4],
  series2:[5.7, 6.8, 7.8, 3.8, 4.29, 3.32, 8.44]
},
'云南':{
  series1:[33.3, 20.2, 17.4, -33.9, 22.7, 29.4, 23.8],
  series2:[5.67, 6.81, 8.0, 5.29, 6.49, 8.4, 10.4]
},
'广东':{
  series1:[12.5, 11.1, 9.2, -54.3, 13.7, 72.8, 75.1],
  series2:[4.07, 4.53, 4.94, 2.26, 2.57, 4.44, 7.77]
},
'广西':{
  series1:[28.2, 30.8, 28.4, -20.4, 20.8, -26.2, 44.1],
  series2:[5.18, 6.78, 8.70, 6.61, 7.98, 5.89, 8.49]
},
'山西':{
  series1:[26.5, 25.5, 18.5, -60.1, -1.3, -11.5, 163.4],
  series2:[5.61, 7.04, 8.34, 3.33, 3.28, 2.90, 7.64]
},
'辽宁':{
  series1:[12.1, 11.7, 13.6, -32.7, -33.8, 10, 142.9],
  series2:[5.03, 5.62, 6.39, 3.02, 2, 2.10, 5.1]
},
'吉林':{
  series1:[16.3, 15.3, 12.2, -37.9, 37.9, -45.4, 173.0],
  series2:[1.91, 2.20, 2.47, 1.53, 2.11, 1.15, 3.14]
},
'黑龙江':{
  series1:[13.4, 11.0, 19.1, -34.1, 14.2, -26.5, 85.1],
  series2:[1.63, 1.81, 2.16, 1.43, 1.6, 1.18, 2.2]
},
'江苏':{
  series1:[9.6, 9.6, 7.6, -46.2, 49.7, -24.5, 81.1],
  series2:[7.43, 8.14, 8.8, 4.7, 7.1, 5.3, 9.4]
},
'浙江':{
  series1:[9.7, 8.7, 5.5, -21.1, -28.5, -26.2, 153.3],
  series2:[6.29, 6.84, 7.22, 5.70, 4.07, 3, 7.6]
},
'安徽':{
  series1:[19.9, 15.2, 13.6, -42.6, 23.4, -14.6, 71.1],
  series2:[6.26, 7.21, 8.2, 4.7, 5.8, 5.0, 8.5]
},
'福建':{
  series1:[21.6, 20.3, 16.7, -29.8, 15.6, -3.8, 45.6],
  series2:[3.75, 4.51, 5.27, 3.70, 4.07, 3.91, 5.70]
},
'江西':{
  series1:[21.6, 19.7, 15.7, -29.6, 33.4, -11.8, 24.9],
  series2:[5.73, 6.86, 7.91, 5.57, 7.43, 6.55, 8.18]
},
'山东':{
  series1:[10.3, 10.2, 8.6, -38.2, 26.6, -19.5, 63.5],
  series2:[7.80, 8.59, 9.33, 5.77, 7.31, 5.88, 8.2]
},
'河南':{
  series1:[14.1, 18.2, 14.7, -38.7, 44.1, -45.1, 128.2],
  series2:[6.62, 7.83, 8.98, 5.51, 7.93, 4.36, 9.95]
},
'湖北':{
  series1:[11.5, 13.8, 12.3, -26.4, 38.7, -5.3, 19.7],
  series2:[6.35, 5.36, 6.01, 4.37, 6.06, 5.85, 7.00]
},
'湖南':{
  series1:[18.3, 12.5, 10.3, 16.2, , 1.0, 51.1],
  series2:[6.7, 7.5, 8.3, 6.9, 4.34, 4.3, 6.6]
},
'贵州':{
  series1:[40.0, 30.2, 17.2, -45.6, 4.3, -23.6, 161.0],
  series2:[7.44, 9.69, 11.34, 6.18, 6.44, 4.92, 12.84]
},
'陕西':{
  series1:[16.4, 20.6, 12.2, -49.2, 9.4, -11.3, 106.5],
  series2:[5.19, 6.26, 7.02, 3.56, 3.91, 3.47, 7.16]
},
'甘肃':{
  series1:[25, 26.4, 24.0, -43.1, 29.7, -51.2, 187.8],
  series2:[2.39, 3.02, 3.70, 2.13, 2.76, 1.35, 3.88]
},
'青海':{
  series1:[21.2, 20.7, 20.9, -34.7, 20.0, -45.7, 100],
  series2:[0.35, 0.42, 0.51, 0.33, 0.40, 0.22, 0.45]
},
'台湾':{
  series1:[0.5, 3.0, 7.2, -88.4, -89.8, 537.8, 624.0],
  series2:[0.11, 0.11, 0.12, 0.01, 0.001, 0.009, 0.65]
},
'内蒙古':{
  series1:[19.1, 12.2, 50.2, -35.3, 5.0, -29.5, 149.1],
  series2:[1.15, 1.29, 1.93, 1.25, 1.31, 0.92, 2.30]
},
'西藏':{
  series1:[10.7, 31.4, 19.2, -11.5, 18.5, -27.7, 83.2],
  series2:[0.25, 0.33, 0.40, 0.35, 0.42, 0.30, 0.55]
},
'宁夏':{
  series1:[21.6, 8.36, 19.9, -14.3, 5.7, 7.2, 79.5],
  series2:[0.31, 0.33, 0.40, 0.34, 0.36, 0.39, 0.70]
},
'新疆':{
  series1:[-2.2, 43.2, 40.8, -25.3, 20.5, -35.8, 114.2],
  series2:[1.05, 1.50, 2.12, 1.58, 1.91, 1.22, 2.62]
},
'天津':{
  series1:[10.4, 9.1, 8.1, -42.3, 26.7, -37.3, 110.5],
  series2:[2.08, 2.27, 2.45, 1.41, 1.79, 1.12, 2.36]
},
'上海':{
  series1:[7.5, 6.7, 6.4, -34.7, 24.5, -36.0, 73.5],
  series2:[3.18, 3.40, 3.61, 2.36, 2.94, 1.88, 3.26]
},
'重庆':{
  series1:[20.3, 10.1, 10.0, -35.5, 37.2, -38.2, 98.9],
  series2:[5.39, 5.93, 6.53, 0.64, 0.88, 0.55, 1.53]
},
'香港':{
  series1:[3.2, 11.4, -14.2, -93.6, -97.4, 561.5, 5523.8],
  series2:[0.58, 0.65, 0.56, 0.04, 0.001, 0.01, 0.34]
},
'澳门':{
  series1:[5.4, 9.8, 10.1, -85.0, 30.7, -26.0, 394.9],
  series2:[0.33, 0.36, 0.39, 0.06, 0.08, 0.06, 0.28]
},
}

var option = {
    backgroundColor: "transparent",
      title: {
        text: "旅游人次",
        left: "center",
        bottom: "5%",
        textStyle: {
          fontSize: 20,
        },
      },
    tooltip: {
      trigger: "axis",
      axisPointer: {
        type: "shadow",
      },
      formatter: function(params) {
        var result = '';
        params.forEach(function(item) {
            if (item.seriesName === '旅游人次') {
                result += item.marker +item.seriesName + ': ' + item.value + ' 亿人次<br>';
            } else if (item.seriesName === '同比增长') {
                result += item.marker+item.seriesName + ': ' + item.value + ' %<br>';
            }
        });
        return result;
      }
    },
    legend: {
      data: [ "旅游人次","同比增长"],
      top: "7%",
    },
    grid: {
      top: "20%",
      left: "5%",
      right: "5%",
      bottom: "15%",
      containLabel: true,
    },
    xAxis: [
      {
        type: "category",
        axisTick: {
          alignWithLabel: true,
        },
        axisLine: {
          lineStyle: {
            color: "black",
          },
        },
        axisTick: {
          show: false,
        },
        data: ["2017", "2018", "2019", "2020", "2021", "2022", "2023"],
      },
    ],
    yAxis: [
      {
        type: "value",
        name: "旅游人次",
        position: "left",
        axisLabel: {
          formatter: "{value}亿人次",
          color: "black",
        },
        axisLine: {
            lineStyle: {
            }
        },
      },
      {
        type: "value",
        name: "同比增长",
        splitLine: {
          show: false,
        },
        position: "right",
        axisLabel: {
          formatter: "{value}%",
          color: "black",
        },
        axisLine: {
            lineStyle: {
                // color: 'white'
            }
        },
      },
      
    ],
    series: [
      {
        name: "同比增长",
        type: "line",
        smooth: true,
        yAxisIndex: 1,
        symbolSize: 8,
        label: {
          normal: {
            show: false,
            position: "top",
          },
        },
        lineStyle: {
          normal: {
            width: 2,
            color: "#cd7461",
          },
        },
        data: [12.8, 10.8, 8.4, -52.1, 12.8, -22.1, 93.3],
      },
      {
        name: "旅游人次",
        type: "bar",
        barWidth:15,
        label: {
          normal: {
            show: true,
            fontSize: 15,
            position: "top",
          },
        },
        itemStyle: {
            barBorderRadius: 5,
            color: '#a893a3' // 设置柱状条的颜色
        },
        data: [50.01, 55.39, 60.06, 28.79, 32.46, 25.3, 48.9, 55.3],
      },
    ],
  };

myChart2.setOption(option);